app/controllers/hamburguesas_controller.rb

  def destroy
    if Hamburguesa.exists?(id: params[:id])
      @hamburguesa = Hamburguesa.find(params[:id])
      IngredienteEnHamburguesa.where(hamburguesa_id: @hamburguesa.id).destroy_all # Elimino todos sus ingredientes asociados
---
SELECT "ingrediente_en_hamburguesas".* FROM "ingrediente_en_hamburguesas" WHERE "ingrediente_en_hamburguesas"."hamburguesa_id" = $1  [["hamburguesa_id", 10]]