app/controllers/hamburguesas_controller.rb

  def index
    @hamburguesas = Hamburguesa.all
---
SELECT "hamburguesas".* FROM "hamburguesas"

  def create
    if (params[:nombre] && params[:precio] && params[:descripcion] && params[:imagen])
      @hamburguesa = Hamburguesa.create(
                                        nombre: params[:nombre],
                                        precio: params[:precio],
                                        descripcion: params[:descripcion],
                                        imagen: params[:imagen],
                                        )
---
INSERT INTO "hamburguesas" ("nombre", "precio", "descripcion", "imagen", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def show
    if (Integer(params[:id]).is_a? Integer) #El id entregado es un integer
      @hamburguesa = Hamburguesa.find(params[:id])
---
SELECT "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @hamburguesa = Hamburguesa.find(params[:id])
    contador = 0
    if (params[:nombre])
        @hamburguesa.update(
                        nombre: params[:nombre]
                        )
        contador = contador + 1
    end
    if (params[:precio])
        @hamburguesa.update(
                        precio: params[:precio]
                        )
        contador = contador + 1
    end
    if (params[:descripcion])
        @hamburguesa.update(
                            descripcion: params[:descripcion]
                            )
       contador = contador + 1
    end
    if (params[:imagen])
        @hamburguesa.update(
                            imagen: params[:imagen]
                            )
---
SELECT "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "hamburguesas" SET "precio" = $1, "updated_at" = $2 WHERE "hamburguesas"."id" = $3  [["precio", 10000], ["updated_at", "2020-04-27 20:09:25.495216"], ["id", 3]]
UPDATE "hamburguesas" SET "nombre" = $1, "updated_at" = $2 WHERE "hamburguesas"."id" = $3  [["nombre", "Hola"], ["updated_at", "2020-04-28 19:17:37.782451"], ["id", 10]]
UPDATE "hamburguesas" SET "precio" = $1, "updated_at" = $2 WHERE "hamburguesas"."id" = $3  [["precio", 7990], ["updated_at", "2020-04-28 19:26:24.206619"], ["id", 10]]
UPDATE "hamburguesas" SET "descripcion" = $1, "updated_at" = $2 WHERE "hamburguesas"."id" = $3  [["descripcion", "Muy rica, recomendada"], ["updated_at", "2020-04-28 19:28:01.109293"], ["id", 10]]

  def destroy
    @hamburguesa = Hamburguesa.find(params[:id])
    @hamburguesa.destroy
---
SELECT "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "hamburguesas" WHERE "hamburguesas"."id" = $1  [["id", 1]]