app/controllers/ingredientes_controller.rb

  def destroy
    @ingrediente = Ingrediente.find(params[:id])
    @ingrediente.destroy
---
DELETE FROM "ingredientes" WHERE "ingredientes"."id" = $1  [["id", 5]]