app/controllers/ingredientes_controller.rb

  def index
    @ingredientes = Ingrediente.all
---
SELECT "ingredientes".* FROM "ingredientes"

  def create
    if (params[:nombre] && params[:descripcion])
      if (params[:nombre].blank? ||  params[:descripcion].blank?)
        render json: {code: 400, description: "input invalido"}, status: 400
      else
        @ingrediente = Ingrediente.create(
                                        nombre: params[:nombre],
                                        descripcion: params[:descripcion],
                                        )
---
INSERT INTO "ingredientes" ("id", "nombre", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 11], ["nombre", "Pepinillos"], ["descripcion", "De la mejor calidad"], ["created_at", "2020-04-28 16:46:33.892816"], ["updated_at", "2020-04-28 16:46:33.892816"]]

  def show
    if (Integer(params[:id]).is_a? Integer) #El id entregado es un integer
      if Ingrediente.exists?(id: params[:id])
        @ingrediente = Ingrediente.find(params[:id])
---
SELECT "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def destroy
    if Ingrediente.exists?(id: params[:id])
      @ingrediente = Ingrediente.find(params[:id])
      if IngredienteEnHamburguesa.exists?(ingrediente_id: @ingrediente.id)
        render json: {code: 409, description: "Ingrediente no se puede borrar, se encuentra presente en una hamburguesa"}, status: 409
      else
        @ingrediente.destroy
---
SELECT "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "ingrediente_en_hamburguesas" WHERE "ingrediente_en_hamburguesas"."ingrediente_id" = $1 LIMIT $2  [["ingrediente_id", 1], ["LIMIT", 1]]
DELETE FROM "ingredientes" WHERE "ingredientes"."id" = $1  [["id", 2]]