app/controllers/ingrediente_en_hamburguesa_controller.rb

SELECT "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "ingrediente_en_hamburguesas" ("ingrediente_id", "hamburguesa_id", "created_at", "updated_at", "path") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ingrediente_id", 10], ["hamburguesa_id", 2], ["created_at", "2020-04-28 16:52:30.614635"], ["updated_at", "2020-04-28 16:52:30.614635"], ["path", "https://hamburgueseria.com/ingrediente/10"]]
---
    def create
      id_ingrediente = params[:id_i]
      if Hamburguesa.exists?(id: params[:id_h])
        @hamburguesa = Hamburguesa.find(params[:id_h])
        if Ingrediente.exists?(id: params[:id_i])
          @ingrediente = Ingrediente.find(params[:id_i])
          if IngredienteEnHamburguesa.exists?(hamburguesa_id: @hamburguesa.id, ingrediente_id: @ingrediente.id)
            render json: {code: 200, description: "operacion exitosa"}, status: 200
          else
            @ingrediente_en_hamburguesa = IngredienteEnHamburguesa.create(
                                              hamburguesa_id: params[:id_h],
                                              ingrediente_id: params[:id_i],
                                              path: "https://hamburgueseria-mbvanwersch.herokuapp.com/ingrediente/#{id_ingrediente}",
                                              )

SELECT "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "ingrediente_en_hamburguesas".* FROM "ingrediente_en_hamburguesas" WHERE "ingrediente_en_hamburguesas"."hamburguesa_id" = $1 AND "ingrediente_en_hamburguesas"."ingrediente_id" = $2  [["hamburguesa_id", 1], ["ingrediente_id", 1]]
SELECT 1 AS one FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "ingrediente_en_hamburguesas" WHERE "ingrediente_en_hamburguesas"."id" = $1  [["id", 1]]
---
    def destroy
      if Hamburguesa.exists?(id: params[:id_h])
        @hamburguesa = Hamburguesa.find(params[:id_h])
        if Ingrediente.exists?(id: params[:id_i])
          @ingrediente = Ingrediente.find(params[:id_i])
          if IngredienteEnHamburguesa.exists?(hamburguesa_id: @hamburguesa.id, ingrediente_id: @ingrediente.id)
            IngredienteEnHamburguesa.where(hamburguesa_id: @hamburguesa.id, ingrediente_id: @ingrediente.id).destroy_all